Revit 2027 API
TessellatedFace.GetBoundaryLoops Method
 Get loops bounding the face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<IList<XYZ>> GetBoundaryLoops()
Public Function GetBoundaryLoops As IList(Of IList(Of XYZ))
public:
IList<IList<XYZ^>^>^ GetBoundaryLoops()
member GetBoundaryLoops : unit -> IList<IList<XYZ>>
Return Value
IList<IList<XYZ>>
See Also
Reference
TessellatedFace Class
Autodesk.Revit.DB Namespace